run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/SlawekTestCase/Kitamura/SlawekTestCase1DSuperFluidWall_DirichletBC_1.954K/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    UP
    {
        type            alphatJayatillekeWallFunctionTemprPr;
        Prt             0.85;
        value           uniform 0;
    }
    DOWN
    {
        type            alphatJayatillekeWallFunctionTemprPr;
        Prt             0.85;
        value           uniform 0;
    }
    SYM
    {
        type            empty;
    }
    ADIABATIC
    {
        type            alphatJayatillekeWallFunctionTemprPr;
        Prt             0.85;
        value           uniform 0;
    }
}


// ************************************************************************* //
