run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/SlawekTestCase/Kitamura/SlawekTestCase1DSuperFluidWall_DirichletBC_1.954K/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (0.01 0 0)
    (0.01 0.2 0)
    (0 0.2 0)
    (0 0 0.001)
    (0.01 0 0.001)
    (0.01 0.2 0.001)
    (0 0.2 0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 800 1) simpleGrading (1 20 1)
);

edges
(
);

boundary
(
    UP
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }
    DOWN
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }
    SYM
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 7 6 5)
        );
    }
    ADIABATIC
    {
        type wall;
        faces
        (
            (0 3 7 4)
            (5 6 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
