run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/SlawekTestCase/Kitamura/SlawekTestCase1DSuperFluidWall_DirichletBC_1.954K/system/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 0.0000000092401476; //hel w temp. 1.7 K

// Turbulent Prandtl number
Prt             [0 0 0 0 0 0 0] 0.7;

MAG_G_CONV_CRIT [0 0 0 0 0 0 0] 1e-3; 
MAG_G_MIN_VALUE [0 0 0 0 0 0 0] 1e-2; 

// ************************************************************************* //
